Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: With the `dev` profile enabled, the property `bar` has the value `hallo`, but the property `baz` has the value `bonjour`. If the `prod` profile is enabled, `bar` has the value `hello` (as there is no specific value for the `prod` profile), and `baz` the value `bonjour`.
ja_jp: `dev` プロファイルを有効にすると、プロパティー `bar` の値は `hallo` になりますが、プロパティー `baz` の値は `bonjour` になります。 `prod` プロファイルが有効になっている場合、 `bar` の値は `hello` (` prod` プロファイルには特定の値がないため) であり、 `baz` の値は `bonjour` です。

source: With the `password_file` is configured in the `mosquitto.conf`, environment variables are not used to set the username and password but to map them to the application properties.
ja_jp: `password_file` が `mosquitto.conf` で設定されている場合、環境変数はユーザー名とパスワードを設定するためではなく、それらをアプリケーションプロパティーにマッピングするために使用されます。

source: With the above rootless setup on Linux, you will need to configure clients, such as Quarkus and testcontainers by setting the `DOCKER_HOST` environment variable to point to the user service podman socket. The path be set using an expression which queries the path using the podman command:
ja_jp: Linux 上で上記のルートレスセットアップを行う場合、Quarkus や testcontainers などのクライアントを設定する必要があります。この場合、 `DOCKER_HOST` 環境変数を設定して、ユーザーサービスの podman ソケットを指すようにします。パスは、podmanコマンドを使用してパスをクエリする式を使用して設定します：

source: With the active record pattern: put all your entity logic in static methods in your entity class and don't create DAOs. Your entity superclass comes with lots of super useful static methods, and you can add your own in your entity class. Users can just start using your entity `Person` by typing `Person.` and getting completion for all the operations in a single place.
ja_jp: アクティブレコードパターンの使用: アクティブレコードパターンでは、すべてのエンティティロジックをエンティティクラスのスタティックメソッドに置き、DAOを作りません。エンティティスーパークラスには、非常に便利なスタティックメソッドがたくさん用意されていますし、エンティティクラスに独自のメソッドを追加することもできます。 `Person` ユーザーは、 `Person` と入力するだけで、すべての操作を一か所で完了させることができます。

source: With the aforementioned example in your `application.properties`, your Hibernate ORM managed database will be populated with test data both during the JVM mode test run and during the native mode test run. The production executable will contain only the `version.txt` resource, no superfluous test data.
ja_jp: 上記の例を `application.properties` に記述すると、Hibernate ORM が管理するデータベースには、JVM モードのテスト実行中とネイティブモードのテスト実行中の両方でテストデータが入力されることになります。本番用の実行ファイルには `version.txt` リソースのみが含まれ、余分なテストデータは含まれません。

source: With the artifacts added to the `Jandex` indexer, you can now search the index to identify classes implementing an interface, sub-classes of a specific class, or classes with a target annotation.
ja_jp: `Jandex` インデクサーに追加されたアーティファクトにより、インターフェイスを実装したクラス、特定のクラスのサブクラス、ターゲットアノテーションを持つクラスなどをインデックスから検索して特定できるようになりました。

source: With the artifacts added to the `Jandex` indexer, you can now search the index to identify classes implementing an interface, subclasses of a specific class, or classes with a target annotation.
ja_jp: アーティファクトが `Jandex` インデクサーに追加されたので、インデックスを検索して、インターフェイスを実装するクラス、特定のクラスのサブクラス、またはターゲットアノテーションを持つクラスを特定できるようになりました。

source: With the centralized TLS configuration
ja_jp: 一元化された TLS 設定の場合

source: With the configuration above, both profile builds will be using the same dependencies, so if we added dependencies on the Oracle and PostgreSQL drivers to the application, both of the drivers will appear in both builds.
ja_jp: 上記の設定では、両方のプロファイルビルドが同じ依存関係を使用するため、アプリケーションに Oracle ドライバーと PostgreSQL ドライバーの依存関係を追加すると、両方のドライバーが両方のビルドに表示されることになります。

source: With the default option, passwords are stored and hashed with https://en.wikipedia.org/wiki/Bcrypt[bcrypt] under the https://en.wikipedia.org/wiki/Crypt_(C)[Modular Crypt Format] (MCF). While using MCF, the hashing algorithm, iteration count, and salt are stored as a part of the hashed value. As such, we do not need dedicated columns to keep them.
ja_jp: デフォルトのオプションでは、パスワードは link:https://en.wikipedia.org/wiki/Bcrypt[bcrypt] でハッシュ化され、 link:https://en.wikipedia.org/wiki/Crypt_©[Modular Crypt Format]（MCF）で保存されます。MCFを使用している場合、ハッシュアルゴリズム、反復回数、およびソルトは、ハッシュ値の一部として保存されます。そのため、これらを保持するための専用カラムは必要ありません。

source: With the default option, passwords are stored and hashed with https://en.wikipedia.org/wiki/Bcrypt[bcrypt] under the https://en.wikipedia.org/wiki/Crypt_\(C)[Modular Crypt Format] (MCF). While using MCF, the hashing algorithm, iteration count, and salt are stored as a part of the hashed value. As such, we do not need dedicated columns to keep them.
ja_jp: デフォルトのオプションでは、パスワードは link:https://en.wikipedia.org/wiki/Bcrypt[bcrypt] で https://en.wikipedia.org/wiki/Crypt_\(C)[モジュラー暗号フォーマット] （MCF）の下で保存され、ハッシュされます。MCFを使用する場合、ハッシュアルゴリズム、反復回数、ソルトはハッシュ値の一部として保存されます。そのため、それらを保持するための専用カラムは必要ありません。

source: With the event bus, you send _messages_ to _virtual addresses_. The event bus offers three types of delivery mechanisms:
ja_jp: イベントバスでは、 _仮想アドレス_ に _メッセージ_ を送信します。イベントバスには、3種類の配送メカニズムが用意されています。

source: With the following command, we will create a greeting message with the id `quarkus`.
ja_jp: 次のコマンドで、id が `quarkus` の挨拶のメッセージを作成します。

source: With the following command, we will display the greeting message with the id `quarkus`.
ja_jp: 次のコマンドで、id が `quarkus` の挨拶のメッセージを表示します。

source: With the gRPC Java server
ja_jp: gRPC Java サーバーの場合

source: With the https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler extension], this expression will be replaced by the bundled scripts and styles.
ja_jp: https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Web Bundler エクステンション] を使用すると、この式はバンドルされたスクリプトとスタイルに置き換えられます。

source: With the https://quarkus.io/guides/cli-tooling[Quarkus CLI]:
ja_jp: link:https://quarkus.io/guides/cli-tooling[Quarkus CLI] を使用した場合:

source: With the interface in place, we will add an `AppConfiguration` class which will use the Spring's Java Config style for defining a bean. It will be used to create a `StringFunction` bean that will capitalize the text passed as parameter. Create a `src/main/java/org/acme/spring/di/AppConfiguration.java` file with the following content:
ja_jp: インターフェイスが整ったところで、SpringのJava Configスタイルを使ってBeanを定義する `AppConfiguration` クラスを追加します。これを使って、パラメータとして渡されたテキストを大文字にする `StringFunction` Beanを作成します。以下の内容で `src/main/java/org/acme/spring/di/AppConfiguration.java` ファイルを作成します:

source: With the introduction of OpenTelemetry Metrics, the original, single page guide had to be split according to signal types, as follows:
ja_jp: OpenTelemetry メトリクスの導入により、1 ページで構成されていた元のガイドを、次のように信号の種類に応じて分割することが必要になりました。。

source: With the notable exception of one special case discussed below, `@Inject` is still required for constructor and method injection.
ja_jp: 後述する特別なケースを除いて、コンストラクターとメソッドの注入には `@Inject` が必要です。

source: With the plain Java version we were able to squeeze the container down to `180 Mb` (below that it would either go _OOM_, or the _GC_ would kill the performances). And for the native version, we were able to go as low as `50 Mb`.
ja_jp: プレーンなJavaバージョンでは、 `180 Mb` までコンテナを絞り込むことができました（それ以下では、 _OOM_になるか、 _GC_がパフォーマンスを殺してしまいます）。また、ネイティブ版では、 `50 Mb` まで下げることができました。

source: With the producer application in place, it's time to implement the actual aggregator application, which will run the Kafka Streams pipeline. Create another project like so:
ja_jp: プロデューサアプリケーションを用意したら、Kafka Streams パイプラインを実行するアグリゲータアプリケーションを実装しましょう。このように別のプロジェクトを作成します。

source: With the project created, you can resume from <<starting-the-broker>> in the detailed steps above and proceed until configuring the `application.properties` file, when you should use the Artemis configuration below instead.
ja_jp: プロジェクトが作成されたら、上記の詳細手順の <<starting-the-broker>> から再開し、 `application.properties` ファイルの設定まで進め、代わりに以下のArtemisの設定を使用します。

source: With the project created, you can resume from xref:starting-the-broker[Starting the broker] in the detailed steps above and proceed until configuring the `application.properties` file, when you should use the Artemis configuration below instead.
ja_jp: プロジェクトが作成されたので、上記の詳細な手順で xref:starting-the-broker[ブローカーの起動] から再開し、 `application.properties` ファイルを設定するところまで進めることができます。

source: With the reactive model, the code runs on event loop threads. These event loops execute multiple concurrent processing units. For example, the same event loop can handle multiple concurrent HTTP requests. The following picture illustrates this reactive execution model:
ja_jp: リアクティブ・モデルでは、コードはイベントループのスレッドで実行されます。 これらのイベントループは、複数の同時処理ユニットを実行します。 例えば、同じイベントループで複数のHTTPリクエストを同時に処理することができます。 次の図は、このリアクティブ実行モデルを示しています：

source: With the repository in place, the next order of business is to create the JAX-RS resource that will use the `FruitRepository`. Create `FruitResource` with the following content:
ja_jp: リポジトリーを配置したら、次に `FruitRepository` を使用する JAX-RS リソースを作成します。次の内容で `FruitResource` を作成します。

source: With the repository in place, the next order of business is to create the Jakarta REST resource that will use the `FruitRepository`. Create `FruitResource` with the following content:
ja_jp: リポジトリができたので、次は `FruitRepository` を利用する Jakarta REST リソースを作成します。 次の内容で `FruitResource` を作成します：

source: With the rise of event-driven architecture, Cloud Events are becoming highly popular. Since Quarkus 1.9, the Kafka Connector used in Quarkus has built-in support for Cloud Events. This post introduced Cloud Events and showed how you could write and read Cloud Events easily.
ja_jp: イベント駆動型アーキテクチャの台頭に伴い、クラウドイベントの人気が高まっています。Quarkus 1.9以降、Quarkusで使用されているKafka ConnectorはCloud Eventsをビルトインでサポートしています。この投稿では、Cloud Eventsを紹介し、Cloud Eventsを簡単に書いたり読んだりする方法を紹介しました。

source: With the tests
ja_jp: テストの際に

source: With the value set to `required`, the server demands client certificates. Set the value to `REQUEST` to allow the server to accept requests without a certificate. This setting is beneficial when supporting authentication methods besides mTLS.
ja_jp: 値を `required` に設定すると、サーバーはクライアント証明書を要求します。 サーバーが証明書なしでリクエストを受け入れることを許可するには、値を `REQUEST` に設定します。 この設定は、mTLS 以外の認証方法をサポートする場合に役立ちます。

source: With these changes in place the `/hello` endpoint will reply with a JSON object instead of a simple String.
ja_jp: これらの変更により、 `/hello` エンドポイントは、単純な文字列ではなくJSONオブジェクトで応答するようになりました。

source: With these changes, if you build the application and then invoke the `hello` method then an LRA will be started before the method is entered and ended after it finishes:
ja_jp: これらの変更により、アプリケーションをビルドしてから `hello` メソッドを呼び出すと、LRAはメソッドに入る前に開始され、メソッドが終了した後に終了します。

source: With these commands, you build your application locally, trigger a container image build, and apply the generated {openshift} resources automatically.
ja_jp: これらのコマンドで、アプリケーションをローカルにビルドし、コンテナイメージのビルドをトリガーし、生成された{openshift}リソースを自動的に適用します。

source: With these great advancements in our platform, and the features they brought about, came great complexity and this is where the journey starts...
ja_jp: このようなプラットフォームの大きな進歩と、それによってもたらされた機能は、非常に複雑なものとなり、ここが旅の始まりでした。

source: With this REST endpoint included in your application, you can simply send a GET request to `/typesafe`, and the application will use an injected typesafe client instance to call the remote service, obtain the films and planets, and return the JSON representation of the resulting list.
ja_jp: この REST エンドポイントをアプリケーションに組み込むと、 `/typesafe` に GET リクエストを送信するだけで、アプリケーションは注入された typesafe クライアントインスタンスを使用してリモートサービスを呼び出し、映画と惑星を取得し、結果のリストの JSON 表現を返します。

source: With this _Context_ object, you can schedule operations in the same context. The context is handy for executing the continuation on the same event loop (as contexts are attached to event loops), as described in the picture above. For example, when you need to call something asynchronous, you capture the current context, and when the response arrives, it invokes the continuation in that context:
ja_jp: この _Context_ オブジェクトを使用すると、同じコンテキスト内で操作をスケジュールできます。 上の図で説明したように、コンテキストは (イベントループにアタッチされるため)、同じイベントループで continuation を実行する場合に便利です。 たとえば何かを非同期的に呼び出す必要がある場合は、現在のコンテキストをキャプチャーし、レスポンスが到着すると、そのコンテキストで continuation を呼び出します。

source: With this approach the client interface could look as follows:
ja_jp: このアプローチでは、クライアントインターフェイスは次のようになります。

source: With this approach when making changes to an entity, make sure to adapt the database schema accordingly; you could also use `validate` to have Hibernate verify the schema matches its expectations.
ja_jp: この方法では、エンティティに変更を加える時にデータベーススキーマに確実に適合させる必要があります。また、 `validate` を使用して、Hibernateにスキーマが期待どおりかを確認させることもできます。

source: With this approach, all datasources used by the same persistence unit are assumed to point to a database of the same vendor (same `db-kind`) and version.
ja_jp: このアプローチでは、同じ永続化ユニットで使用されるすべてのデータソースが、 同じベンダー (同じ `db-kind`) およびバージョンのデータベースを指すと仮定されます。

source: With this approach:
ja_jp: このアプローチでは、以下のようになります。

source: With this build step, any non-abstract class from our root package `my.package` whose name ends with `MessageTransformer` will be made an `@ApplicationScoped` CDI bean.
ja_jp: このビルドステップでは、ルートパッケージ `my.package` から、名前が `MessageTransformer` で終わる非抽象クラスは、 `@ApplicationScoped` CDI Bean になります。

source: With this classic approach, you use a specific API to obtain a logger instance, store it in a static field of a class, and call logging operations upon this instance.
ja_jp: この古典的なアプローチでは、特定のAPIを使用してロガーインスタンスを取得し、それをクラスの静的フィールドに格納し、このインスタンスに対してロギング操作を呼び出します。

source: With this code in place, it's time to rebuild the application and the `aggregator` service in Docker Compose:
ja_jp: このコードで、Docker Composeでアプリケーションと `aggregator` サービスを再構築します:

source: With this code, you should be able to see your container starting if you add your extension to a test application and run `quarkus dev`. However, the application will not be able to connect to it, because no ports are exposed. To expose ports, add `withExposedPorts` to the container construction. For example,
ja_jp: このコードを使用すると、エクステンションをテストアプリケーションに追加して `quarkus dev` を実行すると、コンテナーの起動を確認できるはずです。 ただし、ポートが公開されていないため、アプリケーションは接続できません。ポートを公開するには、コンテナー構造に `withExposedPorts` を追加します。 以下に例を示します。

source: With this configuration the logs will look like
ja_jp: この設定の場合、ログは次のようになります。

source: With this configuration, TLS is enabled and configured as defined in the `management` configuration of the TLS registry.
ja_jp: この設定では、TLS が有効になり、TLS レジストリーの `management` 設定で定義されているとおりに設定されます。

source: With this configuration, a file located at `static/picture.jpg` will be available at: `http://localhost:8080/picture.jpg`.
ja_jp: この設定では、 `static/picture.jpg` にあるファイルは `http://localhost:8080/picture.jpg` で利用可能になります。

source: With this configuration, a file located at `static/picture.jpg` will be available at: `http://localhost:8080/static/picture.jpg`.
ja_jp: この設定では、 `static/picture.jpg` にあるファイルは `http://localhost:8080/static/picture.jpg` で利用可能になります。

source: With this configuration, the following JSON is created:
ja_jp: この設定により、次の JSON が作成されます。

source: With this configuration, when, while running your test, a carrier thread is pinned, the stack trace is dumped in the console:
ja_jp: この設定により、テスト実行中にキャリアスレッドがピン留めされると、スタックトレースがコンソールにダンプされる：

source: With this configuration, you can put your service and message definitions in the `src/main/proto` directory. `quarkus-maven-plugin` will generate Java files from your `proto` files.
ja_jp: この設定では、サービスとメッセージの定義を `src/main/proto` ディレクトリーに置くことができます。 `quarkus-maven-plugin` は、 `proto` ファイルから Java ファイルを生成します。

source: With this converter, our `consume` method will receive the `Movie` objects.
ja_jp: このコンバータにより、 `consume` メソッドは `Movie` オブジェクトを受け取ります。

source: With this dependency included, we have a special value resolver for `io.vertx.core.json.JsonObject` which makes it possible to access the properties of a JSON object in a template:
ja_jp: この依存関係を含めると、`io.vertx.core.json.JsonObject` の特別な値リゾルバーが作成され、テンプレート内の JSON オブジェクトのプロパティーにアクセスできるようになります。

source: With this dependency, and the annotation processor in place you could simply create your repositories as follows:
ja_jp: この依存関係を追加し、アノテーションプロセッサーを配置すると、次のようにリポジトリーを簡単に作成できます。

source: With this dependency, you can then inject Redis clients or _datasource_ (high-level, type-safe API), such as:
ja_jp: この依存関係があれば、次に Redis クライアントや _データソース_ (高レベル、タイプセーフの API) を注入することができます。以下に例を示します。

source: With this experience behind me, I was in a good position to contribute something to ease our lives a bit. I put an eye to all the needs, issues, propositions and blog articles and came up with a new extension to create healthy modern user-interfaces (UI) with Quarkus: Quinoa (standing for Quarkus UI with NO hAssle :).
ja_jp: この経験を背景に、私は私たちの生活を少し楽にするために何か貢献する良い立場にありました。私は、すべてのニーズ、問題、提案、ブログ記事に目を通し、Quarkusで健康的でモダンなユーザーインターフェース（UI）を作成するための新しいエクステンション、Quinoa（Quarkus UI with NO HAssle : の略）を考え出しました。

source: With this extension, you can retrieve the managed instance of Vert.x using either field or constructor injection:
ja_jp: このエクステンションでは、フィールドまたはコンストラクタ・インジェクションのいずれかを使用して、Vert.xのマネージドインスタンスを取得できます。

source: With this feature, we tried to take it a step further and transform that boring learning part to the thing we love most *CODING*..
ja_jp: この機能では、さらに一歩進んで、退屈な学習の部分を、私たちが最も好きな *コーディング* に変えようとしました。

source: With this first alpha release, we are starting the journey ultimately leading to our new major, Quarkus 2.0.
ja_jp: この最初のアルファ版リリースで、新しいメジャーであるQuarkus 2.0に最終的につながる旅が始まりました。

source: With this flag, the tested application is launched with the JVM’s AOT cache output option, and an `app.aot` file is produced next to the built jar (for example `target/quarkus-app/app.aot`). You can then run the application with:
ja_jp: このフラグを使用すると、テスト対象のアプリケーションは JVM の AOT キャッシュ出力オプションで起動され、ビルドされた jar の横に `app.aot` ファイルが生成されます (例: `target/quarkus-app/app.aot`)。その後、アプリケーションを次のように実行できます。

source: With this guide, you'll learn how to index entities into an Elasticsearch or OpenSearch cluster in a heartbeat with Hibernate Search. We will also explore how you can query your Elasticsearch or OpenSearch cluster using the Hibernate Search API.
ja_jp: このガイドでは、Hibernate Search を使用して、エンティティーを Elasticsearch または OpenSearch クラスターに瞬時に同期させる方法を説明します。 また、Hibernate Search API を使用して Elasticsearch または OpenSearch クラスターにクエリーを実行する方法についても説明します。

source: With this guide, you'll learn how to synchronize your entities to an Elasticsearch or OpenSearch cluster in a heartbeat with Hibernate Search. We will also explore how you can query your Elasticsearch or OpenSearch cluster using the Hibernate Search API.
ja_jp: このガイドでは、Hibernate Search を使用して、エンティティを Elasticsearch または OpenSearch クラスタに瞬時に同期させる方法を学びます。また、Hibernate Search API を使用して Elasticsearch または OpenSearch クラスタにクエリを実行する方法についても説明します。

source: With this in mind, let's see how we can develop a CRUD application with Quarkus, which will use the I/O thread to handle the HTTP requests, interact with a database, process the result, and write the HTTP response; in other words: a reactive CRUD application.
ja_jp: これを念頭に置いて、Quarkusを使用してCRUDアプリケーションを開発する方法を見てみましょう。このアプリケーションは、I / Oスレッドを使用してHTTPリクエストを処理し、データベースとやり取りし、結果を処理し、HTTP応答を記述します。言い換えれば、リアクティブCRUDアプリケーションです。

source: With this in mind, we added a new concept of Dev Resource, an adapter between Dev Service concept and https://testcontainers.com/[Testcontainers]. And since we now have fine-grained services - with the Dev Resource per container, we can take this even further, allowing the user to choose the way to use this new Dev Resource concept:
ja_jp: これを念頭に置いて、Dev Service コンセプトと https://testcontainers.com/[Testcontainers] 間のアダプターである Dev Resource という新しいコンセプトを追加しました。また、コンテナーごとに Dev Resource が用意されたきめ細かいサービスが利用できるようになったため、これをさらに進めて、ユーザーがこの新しい Dev Resource 概念の使用方法を選択できるようにします。

source: With this in place, every HTTP request on `/bus/quarkus` sends a message to the event bus, waits for a reply, and when this one arrives, writes the HTTP response:
ja_jp: これにより、 `/bus/quarkus` のすべてのHTTPリクエストは、イベントバスにメッセージを送信し、応答を待ち、その応答が到着すると、HTTPレスポンスを書き込みます。

source: With this metric you provide a function to be periodically probed by a callback. The value returned by the function is the value of the gauge.
ja_jp: このメトリクスを使用すると、コールバックによって定期的にプローブされる関数が提供されます。 関数によって返される値はゲージの値です。

source: With this property set to `allow`, a transaction rollback might only apply to the last non-XA datasource, while other non-XA datasources may have already committed their changes. This can leave the system in an inconsistent state.
ja_jp: このプロパティを `allow` に設定すると、トランザクションのロールバックが最後の非XAデータソースにのみ適用され、他の非XAデータソースはすでに変更をコミットしている可能性があります。この場合、システムは一貫性のない状態になる可能性があります。

source: With this property set to allow, it might happen that a transaction rollback will only be applied to the last non-XA datasource, while other non-XA datasources have already committed their changes, potentially leaving your overall system in an inconsistent state.
ja_jp: このプロパティーを allow に設定すると、トランザクションロールバックが最後の非 XA データソースにのみ適用されます。一方、他の非 XA データソースがすでに変更をコミットしている場合、システム全体が不整合な状態になる可能性があります。

source: With this setup, ensure that only the _active_ datasource is accessed. To achieve this, inject an `InjectableInstance<DataSource>` or `InjectableInstance<Pool>` with an `@Any` qualifier and call xref:cdi-integration.adoc#inactive-synthetic-beans[`getActive()`].
ja_jp: この設定では、_アクティブな_ データソースのみにアクセスできるようにします。 これを実現するには、 `@Any` アノテーションを使用して `InjectableInstance<DataSource>` または `InjectableInstance<Pool>` を挿入し、xref:cdi-integration.adoc#inactive-synthetic-beans[`getActive()`] を呼び出します。

source: With this setup, ensure that only the _active_ persistence unit is accessed. To achieve this, inject an `InjectableInstance<SessionFactory>` or `InjectableInstance<Session>` with an `@Any` qualifier and call xref:cdi-integration.adoc#inactive-synthetic-beans[`getActive()`].
ja_jp: このセットアップでは、 _アクティブな_ 永続化ユニットのみにアクセスするように注意してください。これを実現するには、 `@Any` 修飾子を付けた `InjectableInstance<SessionFactory>` または `InjectableInstance<Session>` を注入し、 xref:cdi-integration.adoc#inactive-synthetic-beans[`getActive()`] を呼び出します。

source: With this, the _run_ method becomes:
ja_jp: これにより、 _run_ メソッドは以下のようになります:

source: With this, we can start implementing the endpoints.
ja_jp: これで、エンドポイントの実装を始めることができます。

source: With this, you can use `WebAuthnHardware` to emulate an authenticator token, as well as the `WebAuthnEndpointHelper` helper methods in order to invoke the WebAuthn endpoints, or even fill your form data for custom endpoints:
ja_jp: これを使うと、 `WebAuthnHardware` を使って認証トークンをエミュレートしたり、WebAuthn のエンドポイントを呼び出すために `WebAuthnEndpointHelper` ヘルパーメソッドを使ったり、カスタムエンドポイントのためにフォームデータを埋めたりすることができるようになります。

source: With this, you can use link:{webauthn-test-api}/io/quarkus/test/security/webauthn/WebAuthnHardware.html[`WebAuthnHardware`] to emulate an authenticator token, as well as the link:{webauthn-test-api}/io/quarkus/test/security/webauthn/WebAuthnEndpointHelper.html[`WebAuthnEndpointHelper`] helper methods in order to invoke the WebAuthn endpoints, or even fill your form data for custom endpoints:
ja_jp: これにより、link:{webauthn-test-api}/io/quarkus/test/security/webauthn/WebAuthnHardware.html[`WebAuthnHardware`] を使用して、 認証トークンをエミュレートしたり、 link:{webauthn-test-api}/io/quarkus/test/security/webauthn/WebAuthnEndpointHelper.html[`WebAuthnEndpointHelper`] ヘルパーメソッドを 使用して WebAuthn エンドポイントを呼び出したり、カスタムエンドポイント用に フォームデータを埋めることができます。

source: With this, you will get context propagation for ArC, Quarkus REST and transactions, if you are using them.
ja_jp: これにより、ArC、Quarkus REST、トランザクションを使用している場合、それらのコンテキストが伝搬されます。

source: With this, you will get context propagation for ArC, RESTEasy Reactive and transactions, if you are using them.
ja_jp: これにより、ArC、RESTEasy、トランザクションを使用している場合は、コンテキスト伝播をすることができます。

source: With this, you will get context propagation for ArC, RESTEasy and transactions, if you are using them.
ja_jp: これにより、ArC、RESTEasy、トランザクションを使用している場合は、コンテキストの伝播を得ることができます。
